#!/bin/bash

##################################################################
# Создать текстовое меню с четырьмя пунктами. При вводе          #
# пользователем номера пункта меню происходит запуск редактора   #
# nano, редактора vi, сетевой утилиты ifconfig или выход из меню.#
##################################################################

while [[ 1 ]] ;do
    echo "
 -------------------------
|     МЕНЮ:               |
| 1 - Запустить nano      |
| 2 - Запустить vi        | 
| 3 - Запустить ifconfig  |
| 4 - Выйти               |
 -------------------------"

    read menu_item

    case "$menu_item" in
        1 ) nano ;;
        2 ) vi ;;
        3 ) ifconfig ;;
        4 ) exit 0 ;;
        * ) echo "Uncorrect item! Try again!"
    esac
done
